{
    "Agent cannot overlap on invalid grid.":[
      "Hey, don't step on those off-limit grid areas!",
      "Remember, you can't go onto the grids that are marked invalid.",
      "Avoid those no-go grid zones, alright?",
      "Keep off the grids that aren't allowed, okay?",
      "You're not supposed to be on the grids that are marked as off-limits.",
      "Make sure you steer clear of the invalid grid areas.",
      "You know you can't go onto those invalid grids, right?",
      "Those grids are a no-no for you, stay away.",
      "Remember the rule: no stepping on invalid grids!",
      "Invalid grids are out of bounds for you, don't forget that.",
      "Stay clear of those grids that are not for you.",
      "You aren't allowed on those grids, remember?",
      "Keep in mind, those grids are a no-entry zone for you.",
      "Don't even think about going onto those invalid grids.",
      "You must avoid the grids that are marked invalid.",
      "Those grids are off-limits, so steer clear.",
      "Remember, no overlapping on the grids that aren't allowed.",
      "Those invalid grids are not for you, stay off them.",
      "Make sure not to wander onto those off-limit grids.",
      "You're not meant to be on those grids, so keep away.",
      "Avoid stepping on the grids that are marked off-limits.",
      "Stay away from the grids that you're not supposed to be on.",
      "Keep off the no-go zones on the grid, okay?",
      "Those grids are a no-go, remember that.",
      "You can't go on those grids, they're off-limits.",
      "Remember, those invalid grids are a no-entry zone for you.",
      "You know you're not supposed to go on those grids, right?",
      "Keep clear of the grids that are not for you.",
      "Don't forget, no stepping onto the off-limit grids.",
      "You must avoid the invalid grid areas, okay?",
      "Invalid grids are a no for you, remember?",
      "Stay clear of those forbidden grid areas.",
      "Remember, those grids are not for stepping on.",
      "You're not allowed on those specific grids, okay?",
      "Those grids are out of bounds, so don't go there.",
      "Make sure to avoid the grids that are marked as invalid.",
      "Those invalid grids? Yeah, stay off them.",
      "Remember, no overlapping on the no-go grid areas.",
      "Keep in mind, those grids are off-limits for you.",
      "You're not supposed to overlap on those invalid grid parts.",
      "Those grids are a no-no for stepping, remember?",
      "Don't tread on those grids marked as invalid.",
      "Stay away from the grids you're not allowed on.",
      "Keep your distance from those off-limit grid areas.",
      "Those invalid grid zones? They're not for you.",
      "Remember, those grids are a no-go for you.",
      "You must not step on those specific grids.",
      "Avoid those grids marked as invalid, alright?",
      "Keep off the grids that are not meant for you.",
      "Stay away from the grids that are out of bounds.",
      "You know those grids are off-limits, right?",
      "Don't step onto those grids you're not supposed to.",
      "Those no-go grids? Yeah, keep away from them.",
      "You can't overlap on those specific grid areas.",
      "Invalid grids are a no-entry zone, remember?",
      "You're not to step on those forbidden grid areas.",
      "Keep away from the grids that are off-limits.",
      "You're not allowed on those invalid grid parts.",
      "Remember, those grids are not for overlapping.",
      "Stay clear of the grids marked as no-go zones.",
      "Those grids are not for you, so avoid them.",
      "Make sure not to step on those invalid grids.",
      "Invalid grids? Yeah, those are a no for you.",
      "You're not meant to go on those specific grid areas.",
      "Remember, don't step on the off-limits grids.",
      "Avoid overlapping on those no-go grid zones.",
      "Stay off those grids that you're not allowed on.",
      "You must not go onto those invalid grid areas.",
      "Keep clear of those grids that are marked as forbidden.",
      "Those grids are out of bounds for you, remember?"
    ],
    "Cannot carry more than one object.":[
      "Remember, you can only handle one item at a time.",
      "Just a heads-up: don't pick up more than one thing.",
      "You're limited to holding a single object, okay?",
      "Make sure to carry only one object at any given time.",
      "Keep it simple, just one item in your hands.",
      "Only one object for you to carry, that's the rule.",
      "You're not designed to hold more than one thing.",
      "It's one at a time for you, no grabbing multiple items.",
      "Stick to carrying just one thing, please.",
      "Your protocol is to handle only one item.",
      "Just a reminder: one object at a time for you.",
      "Ensure you're only lifting one item, alright?",
      "You know the drill: only one object in your possession.",
      "Carrying more than one object is a no-go for you.",
      "Let's keep it to one item in your grasp.",
      "Your capacity is limited to a single object.",
      "Make it a point to only handle one thing.",
      "It's important you only carry one object.",
      "Your task is to hold just one item, remember?",
      "You're programmed to carry only one object.",
      "Limit yourself to just one item, please.",
      "You should only be holding one object at a time.",
      "Keep in mind, more than one object is too much for you.",
      "Stick to the one-item rule, okay?",
      "Just focus on one object at a time.",
      "You're not equipped to handle more than one item.",
      "Carrying multiple items? That's not for you.",
      "One object at a time is your limit.",
      "Hold on to just one item, as per your design.",
      "You're restricted to carrying only one thing.",
      "Make sure you're not holding more than one item.",
      "Your design limits you to one object only.",
      "Just carry one thing, that's your job.",
      "Your programming allows for only one item.",
      "Stick to what you're built for: one object only.",
      "Your capacity is just for one item, not more.",
      "Handle only one object, as instructed.",
      "Don't forget, only one item for you to carry.",
      "Carrying two? Nope, just stick to one.",
      "Your rule is simple: one object at a time.",
      "Only one item in your hands, please.",
      "You're only meant to carry a single item.",
      "Keep it to one object at a time, that's best.",
      "Don't overload yourself, just one item.",
      "Your task is simple: carry only one object.",
      "Remember, your limit is one item only.",
      "One thing at a time, that's how you're designed.",
      "You're set to handle only a single object.",
      "Let's not complicate things, stick to one item.",
      "Your programming limits you to one object.",
      "Stick to the one-object rule, it's important.",
      "Carrying multiple items isn't in your protocol.",
      "You're built for handling just one item.",
      "Your design specifies one object at a time.",
      "Just one item for you, as always.",
      "Remember the one-item-only rule, okay?",
      "You're not meant to carry more than one thing.",
      "Keep to your capacity: just one object.",
      "You're best at handling one item at a time.",
      "Your operational limit is one object.",
      "Just focus on carrying a single item.",
      "Your functionality is set to one object only.",
      "Maintain the rule: only one item in your hands.",
      "You're not designed for multiple items, just one.",
      "Stick to the basics: one object at a time.",
      "Your operating instructions say one item only.",
      "You're good at one thing: carrying one item.",
      "Let's not overdo it, just one item for you.",
      "Carry just one object, as per your guidelines.",
      "You're optimized for handling a single item."
    ],
    "There is no front object.":[
      "Looks like there's nothing in front to grab, try again.",
      "You can't pick that up; there's nothing there.",
      "Oops, seems like there's no object in front to pick up.",
      "Your attempt to pick something up failed, nothing's in front.",
      "No luck this time, there isn't an object in front of you.",
      "Looks like a miss, there's no object to pick up here.",
      "You're trying to pick up something that's not there.",
      "Empty-handed this time, there's no item in front.",
      "You need an object in front to pick up, and there isn't one.",
      "Trying to grab air? There's no object in front.",
      "Seems like a failed attempt, no object is in front to pick up.",
      "Pickup action unsuccessful, there's nothing in front.",
      "No object detected in front for pickup.",
      "Your pickup action didn't work, there's no object there.",
      "Can't pick up what's not there, try again.",
      "Looks like a missed pickup, no object in front.",
      "Your grab missed, as there's nothing in front to pick up.",
      "You can't pick up nothing, there's no object in front.",
      "Seems you tried to pick up an invisible object, there's nothing there.",
      "Pickup action failed, as there's no item in front to grab.",
      "Unsuccessful pickup, the space in front is empty.",
      "No go on the pickup, there's no object in your way.",
      "You missed, as there's nothing in front for you to grab.",
      "The pickup won't work without an object in front.",
      "You're grabbing at thin air, there's no object there.",
      "Failed pickup attempt, no object located in front.",
      "Your pickup action is futile, nothing's in front.",
      "There's no object to pick up in front of you.",
      "Can't complete the pickup, there's no object ahead.",
      "No object, no pickup, try somewhere else.",
      "Your sensors must be off, there's no object to pick up.",
      "You can't grab what isn't there, no object in front.",
      "Pickup error: no object found in front.",
      "Your pickup attempt is in vain, there's nothing ahead.",
      "Sorry, but you can't pick up a non-existent object.",
      "Failed to pick up, as there's no object in the vicinity.",
      "Your grab action won't work, nothing's in front to pick up.",
      "Can't execute the pickup, there's no object in front.",
      "Your pickup action is null, there's no object ahead.",
      "There's no object in front for you to grab, try again.",
      "Your pickup failed, the space in front is clear.",
      "Can't pick up an imaginary object, nothing's there.",
      "Your attempt to grab something failed, there's no object.",
      "You missed the object, actually, there's none in front.",
      "Pickup action not possible, no object detected in front.",
      "You can't pick up what's not there, no object in front.",
      "Looks like a pickup failure, nothing to grab in front.",
      "Empty space ahead, no object to pick up.",
      "You're trying to grab something that doesn't exist there.",
      "Nothing to pick up this time, no object in front.",
      "Pickup action aborted, there's no object ahead.",
      "Can't grab what isn't there, try a different spot.",
      "Your pickup attempt failed, there's no object to grab.",
      "No object in front, so your pickup action is invalid.",
      "You're reaching for nothing, no object to pick up.",
      "Your action to pick up failed, there's nothing in front.",
      "Can't complete the action, no object in front to pick up.",
      "Unsuccessful grab, the front is empty of objects.",
      "There's nothing to pick up, the front is clear.",
      "Can't pick up air, there's no object in front of you.",
      "Your attempt to grab is pointless, there's no object.",
      "You're trying to pick up a non-existent object.",
      "Pickup not possible, no object detected ahead.",
      "You missed, there's nothing in front to grab.",
      "You're grasping at nothing, there's no object there.",
      "Pickup attempt failed, no object found in front.",
      "Can't grab the object in front because there's nothing there.",
      "Unable to pick up anything in front since it's empty.",
      "I can't pick up what's in front because there's nothing ahead.",
      "There's nothing in front to pick up.",
      "Can't retrieve the front object; the space ahead is empty.",
      "Unable to pick up the object in front because the area is clear.",
      "Can't grab anything in front because there's nothing there."
    ],
    "Front object is not a Pickable object.":[
      "You can't pick that up; it's not something you can grab.",
      "That object in front of you isn't meant for picking up.",
      "Looks like what's in front of you isn't grabbable.",
      "The object ahead isn't pick-up-able, so you can't grab it.",
      "You can't pick up that item, it's not designed for that.",
      "That's not an object you can pick up, try something else.",
      "The item in front isn't suitable for picking up.",
      "You're trying to pick up an object that's not meant to be picked up.",
      "That's not a Pickable object in front of you.",
      "Your attempt to pick up is invalid; the object isn't for grabbing.",
      "You can't grab that; it's not a pick-up-able object.",
      "No can do, the object in front isn't meant for lifting.",
      "Your pick-up sensors won't work on that, it's not Pickable.",
      "That in front isn't an object you can pick up.",
      "The item ahead of you isn't designed to be picked up.",
      "You're trying to lift something that's not meant to be lifted.",
      "That's not an object you can handle, find something else.",
      "The thing in front of you? You can't pick that up.",
      "Your grabbing mechanism won't work on that object.",
      "That object isn't compatible with your pick-up function.",
      "The item you're trying to grab isn't pick-up-able.",
      "No luck picking that up; it's not designed for it.",
      "Your grab won't work; the object isn't meant for picking up.",
      "That's not a Pickable object in front, choose another.",
      "You can't pick up that object, it's not suitable.",
      "The object ahead doesn't fit your pick-up criteria.",
      "Sorry, but that's not an item you can pick up.",
      "That object isn't in the pick-up-able category.",
      "The item you're facing isn't meant to be lifted.",
      "No picking up that; it's not a suitable object.",
      "Your pick-up attempt won't succeed with that object.",
      "You can't lift that; it's not a Pickable item.",
      "The object in front of you isn't for picking up.",
      "You're trying to handle something not designed to be handled.",
      "That's not an object within your pick-up capabilities.",
      "You can't grab what's in front; it's not Pickable.",
      "No grabbing that object; it's not meant for it.",
      "Your attempt to pick that up is futile, it's not Pickable.",
      "That's not an object you can just pick up.",
      "The item ahead isn't in the list of things you can lift.",
      "Can't pick that up; it's not designed to be picked.",
      "That object isn't suitable for your picking mechanism.",
      "You're trying to grab something that's not grabbable.",
      "That's not a Pickable object in front of you.",
      "Your pick-up function won't work on that item.",
      "You can't handle that object, it's not for picking up.",
      "The item you're trying to pick up isn't meant for that.",
      "No success in picking that up, it's not the right type.",
      "You can't lift that object, it's not designed for it.",
      "The object in front isn't a candidate for picking up.",
      "Your grab function won't work on that, not Pickable.",
      "That's not an object you can pick up, try a different one.",
      "You can't pick up that item; it's not meant to be handled.",
      "The thing in front isn't suitable for picking up.",
      "You're trying to pick up something that's not pick-up-able.",
      "No picking up that object, it's not the right kind.",
      "Your attempt to lift that is invalid, it's not Pickable.",
      "You can't grab that; it's not a suitable object.",
      "No go on picking that up; it's not designed for it.",
      "The object ahead isn't for your picking mechanism.",
      "That's not a Pickable item in front of you.",
      "Your pickup sensors won't work with that object.",
      "That in front isn't meant to be picked up by you.",
      "Can't grab the object in front because it's not something you can pick up.",
      "I can't pick up the front object; it's not designed to be picked up.",
      "Unable to pick up what's in front since it's not meant to be picked up.",
      "The object in front can't be picked up; it's not pickable.",
      "Can't retrieve the front object because it isn't something that can be picked up.",
      "The object right in front isn't something I can pick up.",
      "Can't pick up the object in front; it's not suitable for picking up."
    ],
    "Front object is not a Storage object.": [
      "The item in front isn't a bin, just so you know.",
      "You should be aware, the object ahead is not a bin.",
      "Just a heads-up: what's in front of you isn't a bin.",
      "Don't mistake the front object for a bin; it's not one.",
      "Keep in mind, the object you see ahead isn't a bin.",
      "The thing in front? That's not a bin.",
      "You might think it's a bin, but the front object isn't.",
      "Just to clarify, the object in front isn't a bin.",
      "The object you're looking at isn't a bin, just so you're aware.",
      "It's important to note that the front object isn't a bin.",
      "You might want to know that what's in front isn't a bin.",
      "The object up front - it's not a bin.",
      "I should tell you, the object in front isn't a bin.",
      "Don't be mistaken, the front object isn't a bin.",
      "For your information, the front object is not a bin.",
      "You might be surprised to find the front object isn't a bin.",
      "Don't get confused, the object in front isn't a bin.",
      "A little clarification: that's not a bin in front of you.",
      "You should recognize that the object in front isn't a bin.",
      "Please note, the object you see ahead is not a bin.",
      "The object in front isn't a bin.",
      "What's in front isn't a trash can.",
      "The item ahead isn't a bin.",
      "The front object isn't a garbage can.",
      "What's directly in front isn't a rubbish bin.",
      "The object right ahead isn't a waste bin.",
      "The thing in front isn't a bin for trash.",
      "The entity in front isn't a recycling bin.",
      "What we have in front isn't a bin.",
      "The object positioned in front isn't a litter bin.",
      "The front item isn't a container for waste.",
      "That in front isn't designed as a bin.",
      "The piece in front doesn't serve as a bin.",
      "What's situated in front isn't a compost bin.",
      "The unit in front doesn't function as a bin.",
      "The object facing us isn't a bin.",
      "What's placed in front isn't meant to be a bin.",
      "The front object doesn't qualify as a bin.",
      "What's located in front isn't a disposal bin.",
      "The thing at the front isn't a bin at all.",
      "That which is in front isn't a bin for disposal.",
      "The item presented in front doesn't act as a bin.",
      "The structure in front isn't recognized as a bin.",
      "What lies in front cannot be called a bin.",
      "The object found in front isn't a bin by any means.",
      "What's in front doesn't resemble a bin.",
      "The item at the front isn't associated with a bin.",
      "The entity ahead doesn't identify as a bin.",
      "What's directly ahead isn't categorized as a bin.",
      "The frontmost object isn't a bin in nature.",
      "The figure in front doesn't represent a bin.",
      "What occupies the front isn't a bin whatsoever.",
      "The thing positioned in front lacks the features of a bin.",
      "The item placed in front falls short of being a bin.",
      "That which stands in front doesn't meet the criteria of a bin.",
      "The object in the forefront isn't equipped to be a bin.",
      "What's showcased in front falls outside the definition of a bin.",
      "The component in front is far from being a bin.",
      "The item leading the front isn't fashioned as a bin.",
      "What's anchored in front bears no resemblance to a bin.",
      "The subject in front diverges from the concept of a bin.",
      "The object at the forefront defies the bin classification.",
      "What's visible in front strays from being a bin.",
      "The piece presented in front is devoid of bin characteristics.",
      "That which is positioned in front veers away from being a bin.",
      "The entity placed in front is void of bin qualities.",
      "What's stationed in front transcends the bin label.",
      "The construct in front is exempt from being a bin.",
      "The item leading isn't encapsulated by the term bin.",
      "What's erected in front doesn't align with the bin archetype."
    ],
    "No object carrying to drop.":[
      "You can't drop anything because your hands are empty.",
      "No object to drop, you're not holding anything.",
      "You need to carry something first to drop it.",
      "Can't drop what you don't have, your hands are empty.",
      "Nothing in your grip to drop, you need to pick up something first.",
      "You're trying to drop an item, but you're not carrying any.",
      "Drop action failed; you're not holding any object.",
      "You can't complete the drop; your hands are empty.",
      "No item to release, you haven't picked up anything.",
      "You need to have something to drop it, and you don't.",
      "Can't perform the drop action without holding an object.",
      "Looks like you've got nothing to drop, pick up an item first.",
      "You're attempting to drop, but there's nothing in your hands.",
      "Your drop action is invalid; you're not carrying anything.",
      "No dropping possible, you're not holding any item.",
      "You seem to be trying to drop something, but your hands are empty.",
      "Drop command can't proceed, no object in your possession.",
      "Can't release what you don't hold, you've got no object.",
      "You're not carrying an item, so you can't drop anything.",
      "Drop action not possible; you need to pick up something first.",
      "You can't drop an item because you're not holding any.",
      "Looks like a failed drop attempt, you're not carrying something.",
      "Your attempt to drop is futile, there's no item in your hands.",
      "No item detected for dropping, you're empty-handed.",
      "Can't execute the drop; you haven't picked up anything.",
      "Drop function failed; no object present to be dropped.",
      "You're trying to drop nothing, you need an item first.",
      "Your hands are empty, so you can't drop any item.",
      "To drop something, you need to carry it first, which you aren't.",
      "You can't let go of an object because there isn't one.",
      "Drop action unsuccessful; you're not holding an object.",
      "You seem to have nothing to drop, pick something up first.",
      "Can't perform a drop without an item in hand.",
      "You're trying to release an item, but there's none in your grasp.",
      "Your drop command is invalid, you need to hold something first.",
      "No object in hand means no dropping action possible.",
      "You can't drop because you're not carrying any item.",
      "Looks like you forgot to pick up an item to drop.",
      "Drop attempt not valid, you need an object in hand first.",
      "Can't let go of what you're not holding, no item to drop.",
      "You're trying to empty hands that are already empty.",
      "Drop action failed, as you're not carrying an item.",
      "Your hands must be full to drop something, and they're not.",
      "You can't drop without holding something first.",
      "No dropping possible, you're carrying nothing.",
      "You seem to want to drop an item, but you haven't picked up any.",
      "Drop command ineffective, you're not holding any object.",
      "Can't release an item, as there's none in your possession.",
      "You're attempting a drop with empty hands, no item to drop.",
      "Your drop action can't proceed, no object being held.",
      "Looks like a misfire, you're trying to drop a non-existent item.",
      "You're empty-handed, so dropping is not an option.",
      "Can't proceed with drop, you need to carry an item first.",
      "You're trying to let go of nothing, pick something up first.",
      "Drop action is moot, you've got no item in hand.",
      "You can't drop what you don't have in your hands.",
      "No item to release, your hands are empty.",
      "You seem to be trying to drop, but you have no item.",
      "Can't drop anything, as you're not carrying any object.",
      "Your attempt to drop fails, you're not holding anything.",
      "Looks like you're trying to drop an invisible item, pick up something real.",
      "Drop action is not viable, you're empty-handed.",
      "You need to pick something up before you can drop it.",
      "You can't drop because there's no item in your possession.",
      "Drop attempt invalid, you're not carrying anything.",
      "You can't drop anything because your hands are empty.",
      "There's nothing to let go of since you're not holding anything.",
      "Can't release anything; your hands are empty.",
      "Nothing to put down since there's nothing in your grasp.",
      "You're not holding anything, so you can't drop anything."
    ],
    "Cannot drop object to a closed Storage object.": [
      "You can't drop the object into a bin that's closed.",
      "The bin is closed, so dropping the object in isn't possible.",
      "Looks like the bin's shut, you can't drop anything in it.",
      "No dropping in the bin until it's open, it's closed now.",
      "That bin's not open for dropping objects in.",
      "You're trying to drop it in a bin, but it's closed.",
      "Drop action failed; the bin you're aiming for is closed.",
      "Can't put the object in a bin that's not open.",
      "This bin's closed, can't drop your item in there.",
      "The bin you're at is shut, you need an open one to drop in.",
      "Your attempt to drop in the bin won't work, it's closed.",
      "Can't drop into this bin, it's got a closed lid.",
      "This bin's lid is shut, no dropping allowed right now.",
      "You're trying to use a bin that's closed, can't drop.",
      "No dropping objects into a closed bin, find an open one.",
      "The bin is closed, so your drop action isn't possible.",
      "Can't complete your drop, the bin's lid is shut.",
      "This bin isn't ready for drops, it's closed.",
      "Your action to drop in the bin is halted, it's closed.",
      "Can't drop in the bin right now, it's not open.",
      "The bin's shut tight, so dropping anything in is a no-go.",
      "No dropping allowed; the bin's top is closed.",
      "Item can't be placed inside; the bin remains closed.",
      "The bin's closure means no dropping the object in.",
      "Dropping off the item? Not possible with the bin closed.",
      "The shut bin prevents any items from being dropped in.",
      "Can't unload the object; the bin's lid is down.",
      "The closed bin means it's a no-go for dropping items.",
      "You can't get rid of the object; the bin's closed.",
      "Object disposal is impossible; the bin isn't open.",
      "Dropping is off the table; that bin's not open.",
      "The object can't be dropped; the bin's completely closed.",
      "No way to drop it in; the bin's securely shut.",
      "Bin's closed—dropping anything inside isn't happening.",
      "The object stays in hand; the bin's not open for dropping.",
      "No depositing items; the bin's lid says 'no entry'.",
      "The bin doesn't accept drops; it's firmly closed.",
      "Can't let go of the object into the bin; it's shut.",
      "No place to drop the object; the bin's not receiving.",
      "The closed bin isn't taking any drops today.",
      "Dropping in the object? Denied by the closed bin.",
      "The bin's closed state prevents object drop-off.",
      "Can't toss it in; the bin is not welcoming drops.",
      "Object drop thwarted by the bin's closed status.",
      "No dropping into the bin; it's clamped shut.",
      "The bin being closed is a barrier to dropping in objects.",
      "Wanted to drop the object, but the bin's not open.",
      "Can't release the object; the bin's entrance is closed.",
      "The object's drop is blocked; the bin's top is sealed.",
      "Dropping the object? Not possible; the bin's sealed off.",
      "The bin's refusal to open prevents object disposal.",
      "Wish to drop it in? Not happening, the bin's shut.",
      "Dropping denied; the bin remains unopened.",
      "The bin's closed facade halts all drops.",
      "Can't proceed with dropping; the bin's lid is sealed.",
      "The object and the closed bin are at an impasse.",
      "No entry for the object; the bin's lid is in place.",
      "Object retention is mandatory; the bin is inaccessible.",
      "The bin's closed condition blocks object entry.",
      "Dropping the object is futile; the bin's lid is closed.",
      "Putting it in the bin won't work; the top is closed tight.",
      "The bin's lid is down, so dropping anything inside is out of the question.",
      "It's a no-go on dropping that; the bin's completely closed.",
      "Can't get rid of it that way; the bin's shut closed.",
      "No dropping allowed; that bin's top is securely fastened.",
      "Trying to put it in the bin? Won't happen, it's closed.",
      "The bin's not accepting anything, its opening is sealed shut.",
      "Forget about dropping it in; that bin is clamped shut.",
      "Can't unload it here; the bin's entrance is closed off.",
      "The attempt to drop it into the bin fails; it's not open for deposits."
    ],
    "Cannot drop objects where there exists another object.": [
      "You can't drop that here, there's already something there.",
      "This spot's taken, find somewhere else to drop the object.",
      "Looks like that area's occupied, try a different spot to drop.",
      "Can't put that down here, there's an object in the way.",
      "This place is already filled, you need to find another spot.",
      "You can't drop it where something else is already placed.",
      "No dropping there, the space is taken.",
      "Find a clear spot, this one's already got an object.",
      "Can't release the object here, there's something in the way.",
      "This location isn't free, look for an empty spot.",
      "You need an empty space to drop that, and this isn't it.",
      "That's not a spot to drop, something's already there.",
      "You can't put it down here, the space is occupied.",
      "Drop somewhere else, this place is taken.",
      "You need a free spot, and this one's not.",
      "Can't drop your object here, there's another one in place.",
      "No dropping in occupied spaces, find an empty area.",
      "This spot isn't free for dropping, there's something already there.",
      "Can't set it down here, this spot's occupied.",
      "You need a vacant spot to drop, and this isn't vacant.",
      "This place is no good for dropping, it's already filled.",
      "Don't drop it here, there's already an object.",
      "Find a spot without an object, this one's taken.",
      "You can't unload here, there's something in the way.",
      "No setting down your item here, it's not empty.",
      "This isn't a drop zone, it's already occupied.",
      "Can't place it here, this spot's already used.",
      "You need an unoccupied space to drop, and this is occupied.",
      "Can't release here, the area's not free.",
      "This location is already holding something, find another.",
      "Drop it elsewhere, this space is already taken.",
      "This isn't the place to drop, there's another object here.",
      "You can't let go of it here, the spot's filled.",
      "No putting down your item in a filled space.",
      "This area's not free for dropping, it's occupied.",
      "Can't place your object here, there's already one.",
      "Don't drop here, it's not an empty space.",
      "This isn't a vacant spot, you can't drop your item.",
      "You need to find a clear area, this one's taken.",
      "Can't unload your object in a space that's already occupied.",
      "This isn't a drop-friendly zone, it's filled.",
      "Don't release it here, there's no room.",
      "You can't put it down in an already occupied space.",
      "Find a space without an object to drop yours.",
      "This spot's not available for dropping, it's taken.",
      "You need an empty location to drop, and this one's not empty.",
      "No setting it down here, the space is used.",
      "Can't drop it in a space that's already filled.",
      "This isn't a good spot, it's already occupied.",
      "You can't free your hands here, the spot's not empty.",
      "Don't put it down here, there's something else.",
      "You need a clear spot to drop, and this is not it.",
      "This area's taken, you can't drop your object here.",
      "Can't drop in a non-empty spot, find an empty one.",
      "This isn't the place to unload, it's occupied.",
      "You can't set it down here, there's no space.",
      "No dropping in this spot, it's already filled.",
      "Can't unload in an occupied area, look for a clear spot.",
      "This spot isn't free for unloading, it's taken.",
      "Don't try to drop it here, there's already an object.",
      "This isn't a vacant area, you can't drop here.",
      "You can't let go of the object in a filled spot.",
      "No placing your item here, the space is occupied.",
      "This location isn't free, find another for dropping.",
      "Don't set it down here, it's not empty.",
      "You need an unoccupied spot, and this one's occupied.",
      "Can't release the object in a space that's not free.",
      "You can't place objects down where there's already one.",
      "Dropping objects isn't possible if another object is in the way.",
      "Can't put anything down there; something else is already there."
    ],
    "Cannot drop objects to a closed Storage bin": [
      "You can't drop the object into a bin that's broken.",
      "The bin is broken, so it's not suitable for dropping objects in.",
      "Looks like the bin's damaged, can't put anything in there.",
      "No dropping in the bin, it's broken at the moment.",
      "That bin's not in working condition for dropping items.",
      "You're trying to use a bin, but unfortunately, it's broken.",
      "Drop action failed; the bin is out of commission.",
      "Can't place the object in a bin that's broken.",
      "This bin's broken, you can't drop your item in it.",
      "The bin you're at is damaged, find one that's intact.",
      "Your attempt to drop in the bin won't work, it's broken.",
      "Can't drop into this bin, it's not in a usable state.",
      "This bin's not fit for use, it's broken.",
      "You're trying to drop in a bin that's out of order.",
      "No dropping objects into a broken bin, look for another.",
      "Can't complete the drop, the bin's condition is poor.",
      "This bin isn't suitable for drops, it's broken.",
      "Your action to drop in the bin is unsuccessful, it's damaged.",
      "Can't drop in the bin right now, it's broken.",
      "Can't put anything in the storage bin because it's closed.",
      "Unable to drop items into a storage bin that's not open.",
      "Dropping objects into a closed storage bin isn't possible.",
      "The storage bin is closed, so you can't place objects inside.",
      "Objects can't be deposited into a storage bin that's shut tight.",
      "Can't dispose of objects in the storage bin; it's sealed.",
      "The closed nature of the storage bin prevents object drop-off.",
      "You can't throw objects into the storage bin while it's closed.",
      "Inserting objects into a closed storage bin is not an option.",
      "The storage bin's closed state stops you from dropping objects in.",
      "No dropping objects into the storage bin; it's firmly closed.",
      "Objects can't be placed into the storage bin due to its closed lid.",
      "Can't unload objects into the storage bin because it's closed up.",
      "The storage bin being closed means no objects can go in.",
      "You're unable to drop objects into the storage bin; it's closed.",
      "Putting objects in the storage bin isn't possible when it's shut.",
      "Can't drop objects in; the storage bin's lid is closed.",
      "The closed storage bin doesn't allow for objects to be dropped inside.",
      "Objects and the storage bin don't mix when it's closed.",
      "You won't be able to place objects in a closed storage bin.",
      "The storage bin, being closed, is off-limits for dropping objects.",
      "Can't toss objects into the storage bin; the lid's not open.",
      "Storage bin's closed, so dropping objects in is a no-go.",
      "Closed storage bins don't accept objects being dropped into them.",
      "Objects remain in hand; the storage bin's lid is closed.",
      "Forget dropping objects in; that storage bin's not opening.",
      "Can't lower objects into the storage bin; it's clamped shut.",
      "The storage bin's closure prohibits any object drop-ins.",
      "Objects can't be surrendered to a storage bin that's snapped shut.",
      "No object dropping here; the storage bin's entrance is closed.",
      "The quest to drop objects in a closed storage bin is futile.",
      "A closed storage bin means you're stuck holding onto objects.",
      "No placing objects in the storage bin; it's in lockdown.",
      "The storage bin's closed status blocks any object deposits.",
      "Can't dispatch objects into the storage bin; it's locked up.",
      "The shut storage bin refuses entry to any objects.",
      "Trying to drop objects into a closed bin? Not happening.",
      "Objects and a closed storage bin? That's a mismatch.",
      "You can't offload objects into the storage bin; it's secured.",
      "Dropping objects into the storage bin is barred; it's closed.",
      "The closed storage bin is a no-entry zone for objects.",
      "Objects have no place in the storage bin while it's shut.",
      "You can't feed objects into the storage bin; it's not receptive.",
      "The storage bin's unwelcoming stance; it's closed to objects.",
      "Closed storage bin? Then it's a dead end for dropping objects.",
      "You can't funnel objects into a storage bin that's not open.",
      "Storage bin's closed—objects can't be introduced inside.",
      "No entry for objects; the storage bin's lid is down.",
      "The storage bin's closed facade means no object drops.",
      "Objects are barred from a closed storage bin; no dropping allowed.",
      "The rule's clear: No dropping objects into a storage bin that's sealed."
    ],
    "There is no object in Storage object.":[
      "You can't pick anything from the bin; it's empty.",
      "The bin's empty, so there's nothing to pick up from it.",
      "Looks like there's no object in the bin for you to grab.",
      "Can't take anything out of the bin, it's empty.",
      "No luck with the bin, it doesn't have any objects.",
      "You're trying to pick something from the bin, but it's empty.",
      "Your pick-up action failed; the bin is empty.",
      "There's nothing in the bin to pick up, try another one.",
      "The bin you're checking is empty, no objects to grab.",
      "Can't pick up from an empty bin, find a different one.",
      "Your attempt to get something from the bin won't work, it's empty.",
      "No objects in this bin for you to pick up.",
      "Looks like the bin's come up empty, no pick up possible.",
      "You can't grab anything from that bin, it's empty.",
      "The bin's void of objects, nothing to pick up.",
      "Can't retrieve anything from the bin, there's nothing in it.",
      "Your search in the bin is in vain, it's empty.",
      "You won't find any objects to pick up in that bin.",
      "The bin's empty, you can't pick up anything from it.",
      "Nothing to grab from the bin, it's completely empty.",
      "You're trying to retrieve something from an empty bin.",
      "Can't complete the pickup, the bin has no objects.",
      "The bin you're at is empty, no objects to pick up.",
      "Your attempt to pick from the bin fails, it's empty.",
      "You can't pick up from an empty bin, there's nothing there.",
      "Looks like you're trying to pick up from an empty bin.",
      "No items in the bin to grab, it's empty.",
      "The bin is barren, nothing inside to pick up.",
      "You're looking in an empty bin, nothing to pick up.",
      "Can't take anything out, the bin's got no objects in it.",
      "Your pick-up mission in the bin is unsuccessful, it's empty.",
      "The bin's empty, you need to find a different one to pick from.",
      "Nothing to retrieve from that bin, it's empty.",
      "Can't pick up from this bin, it has no objects.",
      "Your search in the bin turned up empty, nothing to grab.",
      "The bin you're checking is devoid of objects, no pick up here.",
      "You can't grab anything, the bin's empty.",
      "Looks like a fruitless effort, the bin has no objects.",
      "Can't extract anything from the bin, it's empty.",
      "You won't be able to pick up from that bin, it's empty.",
      "The bin's got nothing in it, no pick up possible.",
      "No objects in the bin for you to take, it's empty.",
      "Your attempt to extract from the bin won't work, nothing in there.",
      "The bin you're at is void of objects, no picking up.",
      "Can't grab from an empty bin, no objects inside.",
      "You're looking to pick up from a bin, but it's empty.",
      "Nothing to pick up from the bin, it's barren.",
      "The bin's empty, no chance of picking up anything.",
      "You're trying to get something from a bin with nothing in it.",
      "Can't complete your pickup from the bin, it's empty.",
      "No luck with that bin, it's got nothing in it.",
      "Your pick-up attempt from the bin fails, it's empty.",
      "The bin is empty, so there's nothing for you to pick up.",
      "You won't find anything in that bin, it's empty.",
      "The bin's devoid of objects, no pickup for you.",
      "Can't take anything from an empty bin, it's barren.",
      "Your pickup from the bin is unsuccessful, it's got nothing.",
      "The bin you're at is empty, no objects to grab.",
      "Nothing in the bin to pick up, it's completely empty.",
      "You're trying to pick up from a bin, but it's got nothing.",
      "Can't retrieve from the bin, there's nothing in it.",
      "Your search in the bin is futile, it's empty.",
      "The bin is empty; there's nothing inside.",
      "Nothing's in the bin; it's completely empty.",
      "The bin doesn't have any objects in it.",
      "There aren't any items in the bin.",
      "No objects are found within the bin.",
      "The bin is void of any objects.",
      "It's empty in the bin; no objects at all.",
      "The bin contains no objects inside it."
    ],
    "Cannot get object from a broken Storage object.": [
      "You can't pick anything from that bin; it's broken.",
      "The bin's damaged, so no picking up from there.",
      "Looks like that bin is out of order, can't use it to pick up anything.",
      "No luck with that bin, it's broken, find another.",
      "That bin's not functioning, you can't pick up from it.",
      "You're trying to use a broken bin, it won't work.",
      "Your pick-up action failed, the bin is out of commission.",
      "Can't retrieve anything from a broken bin.",
      "This bin's broken, no point trying to pick up from it.",
      "The bin you're at is damaged, find a working one.",
      "Your attempt to pick from the bin won't work, it's broken.",
      "Can't use this bin, it's not in working order.",
      "This bin's out of service, can't pick up anything.",
      "You're trying to get something from a broken bin.",
      "No picking up from a damaged bin, look for another.",
      "Can't complete the pickup, the bin is broken.",
      "This bin's not usable, it's broken.",
      "Your attempt to pick up from this bin is in vain, it's damaged.",
      "Can't grab anything from a non-functional bin.",
      "The bin you're trying to use is broken, can't pick up from it.",
      "You're looking at a broken bin, no pickup possible.",
      "This bin is out of order, you need to find a different one.",
      "Can't use a broken bin, it won't work.",
      "You're trying to pick up from a bin that's not working.",
      "This bin's no good, it's broken.",
      "The bin you're attempting to use is damaged.",
      "Can't pick up from this bin, it's out of service.",
      "You're at a broken bin, it's not going to work.",
      "This bin is inoperable, no picking up from here.",
      "The bin's broken, you'll need to find another one.",
      "You can't use that bin, it's not functioning.",
      "Looks like the bin you're at is broken, try a different one.",
      "Can't retrieve from a bin that's out of commission.",
      "This bin's not operational, can't pick up anything.",
      "You're trying to use a bin that's broken, it won't work.",
      "No luck with the broken bin, find a working one.",
      "Can't complete the pickup, the bin is not usable.",
      "This bin is damaged, you can't use it for picking up.",
      "You're attempting to use a bin that's not in working order.",
      "Can't pick up from a bin that's out of service.",
      "The bin's condition is not suitable for use.",
      "You're facing a broken bin, it's not for picking up.",
      "This bin's not going to work, it's broken.",
      "The bin is non-functional, can't pick up from it.",
      "You're at a bin that's not operational, try another.",
      "This bin's broken, not good for picking up.",
      "The bin you're trying to use is out of order.",
      "Can't use this broken bin, it won't function properly.",
      "You're attempting to pick from a bin that's damaged.",
      "No picking up from this non-working bin.",
      "The bin's not in a state to be used, it's broken.",
      "This bin's out of order, no picking up from it.",
      "You can't pick up from a bin that's not functional.",
      "Looks like this bin is broken, you'll need to find another.",
      "Can't pick up from a bin that's in disrepair.",
      "You're facing a non-operational bin, it won't work.",
      "This bin's condition is not fit for picking up.",
      "The bin you're at is broken, can't use it.",
      "Can't retrieve from a bin that's not in working condition.",
      "This bin's not ready for use, it's broken.",
      "You're trying to use a bin that's not fit for service.",
      "No luck with the broken bin, need to find a working one.",
      "The bin's not able to be used, it's damaged.",
      "Can't complete your pickup, the bin is inoperable.",
      "You can't retrieve anything from a bin that's broken.",
      "Getting objects out of a broken bin isn't possible.",
      "Can't take anything from a bin if it's damaged.",
      "A broken bin means you can't pull objects from it.",
      "Retrieving objects from a broken bin is out of the question.",
      "If the bin is broken, you can't get objects from it."
    ],
    "Cannot get object from a closed Storage object.": [
      "You can't pick anything from that bin; it's closed.",
      "The bin's closed, so no picking up from there.",
      "Looks like you can't access the bin, it's shut.",
      "No luck with that bin, it's closed, find another.",
      "That bin's not accessible, you can't pick up from it.",
      "You're trying to use a closed bin, it won't work.",
      "Your pick-up action failed; the bin is sealed.",
      "Can't retrieve anything from a closed bin.",
      "This bin's closed, no point trying to pick up from it.",
      "The bin you're at is shut, find an open one.",
      "Your attempt to pick from the bin won't work, it's closed.",
      "Can't use this bin, it's securely closed.",
      "This bin's shut tight, can't pick up anything.",
      "You're trying to get something from a closed bin.",
      "No picking up from a sealed bin, look for an open one.",
      "Can't complete the pickup, the bin is closed.",
      "This bin's not accessible, it's closed.",
      "Your attempt to pick up from this bin is in vain, it's sealed.",
      "Can't grab anything from a closed bin.",
      "The bin you're trying to use is closed, can't pick up from it.",
      "You're looking at a closed bin, no pickup possible.",
      "This bin is closed, you need to find a different one.",
      "Can't use a closed bin, it won't open.",
      "You're trying to pick up from a bin that's shut.",
      "This bin's no good, it's closed.",
      "The bin you're attempting to use is sealed.",
      "Can't pick up from this bin, it's closed.",
      "You're at a closed bin, it's not going to open.",
      "This bin is shut, no picking up from here.",
      "The bin's closed, you'll need to find an open one.",
      "You can't use that bin, it's not open.",
      "Looks like the bin you're at is closed, try a different one.",
      "Can't retrieve from a bin that's sealed shut.",
      "This bin's not operational, it's closed.",
      "You're trying to use a bin that's closed, it won't open.",
      "No luck with the closed bin, find an open one.",
      "Can't complete the pickup, the bin is not open.",
      "This bin is shut, you can't use it for picking up.",
      "You're attempting to use a bin that's not open.",
      "Can't pick up from a bin that's closed.",
      "The bin's condition is not suitable for use, it's shut.",
      "You're facing a closed bin, it's not for picking up.",
      "This bin's not going to open, it's closed.",
      "The bin is not functional, can't pick up from it.",
      "You're at a bin that's not open, try another.",
      "This bin's closed, not good for picking up.",
      "The bin you're trying to use is sealed shut.",
      "Can't use this closed bin, it won't function for pickup.",
      "You're attempting to pick from a bin that's shut tight.",
      "No picking up from this non-opening bin.",
      "The bin's not in a state to be used, it's closed.",
      "This bin's shut, no picking up from it.",
      "You can't pick up from a bin that's not open.",
      "Looks like this bin is closed, you'll need to find an open one.",
      "Can't pick up from a bin that's tightly sealed.",
      "You're facing a non-operational bin, it's shut.",
      "This bin's condition is not fit for pickup, it's closed.",
      "The bin you're at is closed, can't use it.",
      "Can't retrieve from a bin that's not open.",
      "This bin's not ready for use, it's closed.",
      "You're trying to use a bin that's not accessible.",
      "No luck with the closed bin, need to find an open one.",
      "The bin's not able to be used, it's shut.",
      "Can't complete your pickup, the bin is sealed.",
      "This bin's not functional, can't pick up from it.",
      "You're at a bin that's closed, find an open one.",
      "You can't retrieve anything from a bin that's closed.",
      "Getting objects out of a closed bin isn't possible.",
      "Can't take anything from a bin if it's shut.",
      "A closed bin means you can't pull objects from it."
    ],
    "Cannot drop to a Storage object when it contains another object inside.": [
      "You can't drop into the bin; it's already got something in it.",
      "The bin's full, so find a different place to drop.",
      "Looks like the bin is occupied, can't drop there.",
      "Can't drop there, the bin isn't empty.",
      "That bin's taken, need to look for another spot.",
      "You're trying to drop into a bin that's not empty.",
      "Drop action failed; there's already something in the bin.",
      "Can't drop into that bin, it's holding something already.",
      "This bin's full, you can't drop your item here.",
      "The bin you're trying to use is occupied, find an empty one.",
      "Your attempt to drop into the bin won't work, it's full.",
      "Can't use this bin, it's already filled.",
      "This bin's already in use, find another one to drop into.",
      "You're trying to drop into a bin that's full.",
      "No dropping into a bin that's already occupied.",
      "Can't complete the drop, the bin already contains an item.",
      "This bin isn't available, it's full.",
      "Your attempt to drop into this bin is in vain, it's occupied.",
      "Can't drop into a bin that's not empty.",
      "The bin you're trying to drop into is full, find another.",
      "You're looking at a full bin, no dropping there.",
      "This bin is occupied, you need to find a different one.",
      "Can't drop in a bin that's already used.",
      "You're trying to drop into a bin that's not free.",
      "This bin's no good for dropping, it's full.",
      "The bin you're trying to use is occupied.",
      "Can't drop into this bin, it's full.",
      "You're at a full bin, it's not available for dropping.",
      "This bin is occupied, no dropping here.",
      "The bin's full, you'll need to find an open one.",
      "You can't use that bin, it's already holding something.",
      "Looks like the bin you're at is full, try a different one.",
      "Can't drop into a bin that's occupied.",
      "This bin's not suitable, it's full.",
      "You're trying to use a bin that's not available.",
      "No luck with the full bin, find an empty one.",
      "Can't complete the drop, the bin is not free.",
      "This bin is taken, can't use it for dropping.",
      "You're trying to drop into a bin that's not vacant.",
      "Can't drop into a bin that's full.",
      "The bin's condition is not suitable for dropping, it's occupied.",
      "You're facing a full bin, it's not for dropping.",
      "This bin's not going to work, it's full.",
      "The bin is not available, can't drop into it.",
      "You're at a bin that's not free, try another.",
      "This bin's full, not suitable for dropping.",
      "The bin you're trying to use is occupied.",
      "Can't use this full bin, it's not available.",
      "You're trying to drop into a bin that's taken.",
      "No dropping into this occupied bin.",
      "The bin's not in a state to be used for dropping, it's full.",
      "This bin's occupied, no dropping into it.",
      "You can't drop into a bin that's already in use.",
      "Looks like this bin is full, you'll need to find an empty one.",
      "Can't drop into a bin that's already holding something.",
      "You're facing an occupied bin, it won't work for dropping.",
      "This bin's condition is not fit for dropping, it's occupied.",
      "The bin you're at is full, can't use it for dropping.",
      "Can't drop into a bin that's already used.",
      "This bin's not ready for more items, it's full.",
      "You're trying to use a bin that's already taken.",
      "No luck with the full bin, need to find an empty one.",
      "The bin's not able to be used for dropping, it's occupied.",
      "Can't complete your drop, the bin is full.",
      "This bin's not available for dropping, it's occupied.",
      "You're at a bin that's full, find an empty one.",
      "This bin's already in use, can't drop here.",
      "You can't put things in the bin if there's already something inside.",
      "Dropping items into a bin isn't possible when another object is inside.",
      "Can't add to the bin; it's occupied by another object."
    ],
    "Fail to open a storage object which is already open.": [
      "You can't open the bin; it's already open.",
      "The bin's already open, no need to open it again.",
      "Looks like you're trying to open an open bin.",
      "No need to open that bin, it's already wide open.",
      "That bin's already open, you can't open it further.",
      "You're attempting to open a bin that's not closed.",
      "Trying to open an open bin? It's already accessible.",
      "The bin is already open, no opening necessary.",
      "You can't open what's already open, the bin is ready to use.",
      "The bin you're at is open, no need to open it again.",
      "Your attempt to open the bin is redundant, it's already open.",
      "Can't open this bin, it's not closed.",
      "This bin's already open, find another task.",
      "You're trying to open a bin that's already open.",
      "No opening an already open bin, look for a closed one.",
      "Can't complete the open action, the bin is already open.",
      "This bin isn't closed, it's open.",
      "Your attempt to open this bin is unnecessary, it's open.",
      "Can't open a bin that's not closed.",
      "The bin you're trying to open is already open, find another.",
      "You're looking at an open bin, no opening needed.",
      "This bin is open, you need to find a closed one.",
      "Can't open a bin that's already open.",
      "You're trying to open a bin that's not shut.",
      "This bin's no good for opening, it's already open.",
      "The bin you're trying to use is open.",
      "Can't open this bin, it's already open.",
      "You're at an open bin, it's not available for opening.",
      "This bin is already open, no opening here.",
      "The bin's open, you'll need to find a closed one.",
      "You can't use that bin for opening, it's already open.",
      "Looks like the bin you're at is open, try a different one.",
      "Can't open a bin that's already open.",
      "This bin's not suitable for opening, it's open.",
      "You're trying to use a bin that's already open.",
      "No luck with the open bin, find a closed one.",
      "Can't complete the open action, the bin is already open.",
      "This bin is already open, can't use it for opening.",
      "You're trying to open a bin that's already accessible.",
      "Can't open a bin that's already open.",
      "The bin's condition is not suitable for opening, it's open.",
      "You're facing an open bin, it's not for opening.",
      "This bin's not going to work for opening, it's already open.",
      "The bin is not available for opening, it's open.",
      "You're at a bin that's open, try another.",
      "This bin's open, not suitable for opening.",
      "The bin you're trying to use is open.",
      "Can't use this open bin, it's not closed.",
      "You're trying to open a bin that's not shut.",
      "No opening an already accessible bin.",
      "The bin's not in a state to be opened, it's already open.",
      "This bin's open, no need for opening it.",
      "You can't open a bin that's already in use.",
      "Looks like this bin is open, you'll need to find a closed one.",
      "Can't open a bin that's already holding something.",
      "You're facing an open bin, it won't work for opening.",
      "This bin's condition is not fit for opening, it's open.",
      "The bin you're at is open, can't use it for opening.",
      "Can't open a bin that's already being used.",
      "This bin's not ready for opening, it's open.",
      "You're trying to use a bin that's already accessible.",
      "No luck with the open bin, need to find a closed one.",
      "The bin's not able to be opened, it's already open.",
      "Can't complete your open action, the bin is open.",
      "This bin's not available for opening, it's open.",
      "You're at a bin that's open, find a closed one.",
      "This bin's already accessible, can't open here.",
      "Can't open the bin because it's already open.",
      "Trying to open a bin that's already open won't work.",
      "You fail to open the bin since it's already open."
    ],
    "Cannot pedal a broken Storage object.": [
      "You can't pedal this bin; it's broken.",
      "The bin's broken, so pedaling it won't work.",
      "Looks like you can't use the pedal on this bin, it's damaged.",
      "No luck with the pedal here, the bin's broken.",
      "That bin's pedal is out of order, can't use it.",
      "You're trying to pedal a bin that's not working.",
      "Pedal action failed; this bin is broken.",
      "Can't operate the pedal on a broken bin.",
      "This bin's broken, no point trying to pedal it.",
      "The bin you're at has a broken pedal, find another.",
      "Your attempt to pedal the bin won't work, it's broken.",
      "Can't use the pedal on this bin, it's damaged.",
      "This bin's pedal is out of commission, can't use it.",
      "You're trying to use a pedal on a bin that's broken.",
      "No pedaling a broken bin, find one that's working.",
      "Can't complete the pedal action, the bin is broken.",
      "This bin's pedal isn't functioning, it's broken.",
      "Your attempt to use the pedal is futile, the bin's broken.",
      "Can't operate a broken pedal on this bin.",
      "The bin you're trying to use has a broken pedal.",
      "You're looking at a bin with a broken pedal.",
      "This bin is broken, its pedal won't work.",
      "Can't pedal a bin that's already broken.",
      "You're trying to pedal a bin that's out of order.",
      "This bin's no good, its pedal is broken.",
      "The bin you're trying to pedal is not functioning.",
      "Can't pedal this broken bin, it won't work.",
      "You're at a bin with a broken pedal, it's unusable.",
      "This bin is out of order, its pedal is broken.",
      "The bin's pedal is broken, you'll need to find a working one.",
      "You can't use the pedal on that bin, it's broken.",
      "Looks like the bin you're at has a broken pedal, try a different one.",
      "Can't use the pedal on a bin that's out of order.",
      "This bin's pedal isn't working, it's broken.",
      "You're trying to use a pedal on a bin that's not operational.",
      "No luck with the broken pedal, find a bin that's working.",
      "Can't complete the pedal action, the bin's pedal is broken.",
      "This bin is unusable, its pedal is damaged.",
      "You're attempting to use a pedal on a bin that's not working.",
      "Can't use the pedal on a bin that's broken.",
      "The bin's condition is not suitable for pedaling, it's broken.",
      "You're facing a broken bin, its pedal won't work.",
      "This bin's pedal is not going to work, it's broken.",
      "The bin is not functional for pedaling, it's broken.",
      "You're at a bin that's not pedal-able, it's broken.",
      "This bin's broken, not suitable for pedaling.",
      "The bin you're trying to use has a non-functional pedal.",
      "Can't use this bin with a broken pedal.",
      "You're trying to pedal a bin that's broken.",
      "No pedaling on this bin, it's out of order.",
      "The bin's not in a state to be pedaled, it's broken.",
      "This bin's pedal is broken, no pedaling here.",
      "You can't operate the pedal on a bin that's broken.",
      "Looks like this bin's pedal is broken, find an operational one.",
      "Can't pedal a bin with a broken mechanism.",
      "You're facing a bin with a non-working pedal.",
      "This bin's pedal is broken, not fit for use.",
      "The bin you're at has a broken pedal, can't use it.",
      "Can't pedal a bin that's out of commission.",
      "This bin's pedal is not ready for use, it's broken.",
      "You're trying to use a bin with a broken pedal.",
      "No luck with the broken pedal, need to find an operational bin.",
      "The bin's pedal is not able to be used, it's broken.",
      "Can't complete your action, the bin's pedal is broken.",
      "This bin's not available for pedaling, its pedal is broken.",
      "You can't pedal a bin that's broken.",
      "Pedaling a broken bin isn't possible.",
      "Can't operate the pedal on a broken bin.",
      "A broken bin means no pedaling can be done.",
      "The pedal won't work on a bin that's broken."
    ],
    "Cannot grasp a broken Storage object.": [
      "Grasping a broken bin just isn't feasible.",
      "You can't effectively grasp onto a broken bin.",
      "It's impossible to securely grasp a broken bin.",
      "A broken bin cannot be firmly grasped.",
      "Trying to grasp a broken bin won't work.",
      "Can't get a solid grasp on a broken bin.",
      "A broken bin eludes a proper grasp.",
      "Grasping a broken bin is out of the question.",
      "A firm grasp on a broken bin? Not happening.",
      "You won't manage to grasp a broken bin effectively.",
      "A broken bin defies any attempt to grasp it.",
      "No way to safely grasp a broken bin.",
      "Grasping a broken bin is a futile effort.",
      "Don't even try to grasp a broken bin.",
      "A broken bin can't be securely grasped.",
      "You'll find it impossible to grasp a broken bin.",
      "A stable grasp on a broken bin? Impossible.",
      "Grasping at a broken bin is a lost cause.",
      "You simply can't grasp a broken bin.",
      "A broken bin: ungraspable by design.",
      "To grasp a broken bin is to court failure.",
      "You can't get a handle on a broken bin by grasping.",
      "Grasping a broken bin is like trying to catch smoke.",
      "An attempt to grasp a broken bin is doomed.",
      "Grasping a broken bin? That's a no-go.",
      "A broken bin makes for a poor grip.",
      "Forget about getting a grasp on a broken bin.",
      "A broken bin offers no good grasp.",
      "Trying to grasp a broken bin is ineffective.",
      "Can't maintain a grasp on a broken bin.",
      "A broken bin: not suitable for grasping.",
      "Grasping a broken bin is impractical.",
      "To grasp a broken bin is a challenge unmet.",
      "A broken bin frustrates any grasp.",
      "You can't grasp a broken bin and expect success.",
      "Hoping to grasp a broken bin? Think again.",
      "A broken bin slips away from any grasp.",
      "Grasping a broken bin is an exercise in futility.",
      "A broken bin resists all efforts to grasp.",
      "You cannot get a good grasp on a broken bin.",
      "Grasping a broken bin is a non-starter.",
      "Don't bother trying to grasp a broken bin.",
      "A broken bin is beyond a successful grasp.",
      "A broken bin denies any kind of grasp.",
      "Grasping a broken bin? Futile from the start.",
      "You'll never manage to grasp a broken bin right.",
      "A broken bin: a grasp's worst enemy.",
      "A solid grasp on a broken bin? Forget it.",
      "Grasping a broken bin is not in the cards.",
      "A broken bin and a successful grasp don't mix.",
      "Trying to grasp a broken bin is a bad idea.",
      "Grasping a broken bin? More difficult than it sounds.",
      "You can't just grasp a broken bin and go.",
      "A broken bin undermines any attempt at grasping.",
      "Grasping a broken bin is as hard as it sounds.",
      "Never expect to grasp a broken bin successfully.",
      "A broken bin is resistant to your grasp.",
      "You'd be hard-pressed to grasp a broken bin.",
      "A broken bin is unwelcoming to grasps.",
      "Grasping a broken bin is asking for trouble.",
      "A grasp on a broken bin is always uncertain.",
      "You can't confidently grasp a broken bin.",
      "A broken bin won't yield to your grasp.",
      "Grasping a broken bin? A clearly flawed plan.",
      "You'll struggle to grasp a broken bin.",
      "A broken bin makes grasping a risky affair.",
      "Don't count on grasping a broken bin.",
      "Grasping a broken bin is a dubious endeavor.",
      "A broken bin laughs in the face of grasps.",
      "A successful grasp on a broken bin? Unlikely."
    ],
    "Cannot lift a broken Storage object.": [
      "You can't lift this bin; it's broken.",
      "The bin's broken, lifting it isn't an option.",
      "Looks like lifting this bin won't work, it's damaged.",
      "No luck with lifting the bin, it's broken.",
      "That bin's not in a condition to be lifted, it's broken.",
      "You're trying to lift a bin that's not functioning.",
      "Lifting action failed; this bin is broken.",
      "Can't lift a broken bin.",
      "This bin's broken, no point trying to lift it.",
      "The bin you're at is broken, can't lift it.",
      "Your attempt to lift the bin won't work, it's broken.",
      "Can't lift this bin, it's damaged.",
      "This bin's too damaged to lift, find another.",
      "You're trying to lift a bin that's broken.",
      "No lifting a broken bin, look for a whole one.",
      "Can't complete the lift, the bin is broken.",
      "This bin isn't fit for lifting, it's broken.",
      "Your attempt to lift this bin is in vain, it's broken.",
      "Can't lift a bin that's fallen apart.",
      "The bin you're trying to lift is broken, find another.",
      "You're looking at a bin that's too damaged to lift.",
      "This bin is broken, it can't be lifted safely.",
      "Can't lift a bin that's already broken.",
      "You're trying to lift a bin that's not intact.",
      "This bin's no good for lifting, its structure is compromised.",
      "The bin you're trying to use is too damaged to lift.",
      "Can't lift this broken bin, it won't hold up.",
      "You're at a bin with compromised integrity, it's un-liftable.",
      "This bin is out of order, it can't be lifted.",
      "The bin's broken, you'll need to find a sturdy one.",
      "You can't use that bin for lifting, it's broken.",
      "Looks like the bin you're at is broken, try a different one.",
      "Can't use the lift on a bin that's out of shape.",
      "This bin's not in a state to be lifted, it's damaged.",
      "You're trying to use a lift on a bin that's not operational.",
      "No luck with the broken bin, find one that's intact.",
      "Can't complete the lift action, the bin's structure is compromised.",
      "This bin is unusable, it's too damaged to be lifted.",
      "You're attempting to use a lift on a bin that's not functional.",
      "Can't use the lift on a bin that's broken.",
      "The bin's condition is not suitable for lifting, it's damaged.",
      "You're facing a broken bin, it can't be lifted securely.",
      "This bin's not going to work for lifting, it's broken.",
      "The bin is not functional for lifting, it's damaged.",
      "You're at a bin that's not lift-able, it's broken.",
      "This bin's broken, not suitable for lifting.",
      "The bin you're trying to use is too damaged for a secure lift.",
      "Can't use this bin with a broken structure.",
      "You're trying to lift a bin that's falling apart.",
      "No lifting this bin, it's out of order.",
      "The bin's not in a state to be lifted, it's too damaged.",
      "This bin's too broken to lift, no lifting here.",
      "You can't lift a bin that's falling apart.",
      "Looks like this bin is too damaged, find one that's intact.",
      "Can't lift a bin with a compromised structure.",
      "You're facing a bin that's too damaged for lifting.",
      "This bin's condition is not fit for lifting, it's broken.",
      "The bin you're at is too damaged to lift, find another.",
      "Can't lift a bin that's out of commission.",
      "This bin's too broken for a secure lift.",
      "You're trying to use a bin that's not capable of being lifted.",
      "No luck with the damaged bin, need to find a whole one.",
      "The bin's too damaged to be used for lifting, it's broken.",
      "Can't complete your action, the bin is too damaged.",
      "This bin's not available for lifting, it's too broken.",
      "You can't lift a bin that's broken.",
      "Lifting a broken bin is not possible.",
      "Can't pick up a broken bin.",
      "A broken bin just can't be lifted.",
      "It's impossible to raise a broken bin off the ground."
    ],
    "You are doing well so far.":[
      "You're on the right track so far, keep it up!",
      "So far, so good, you're doing great!",
      "Everything's looking good up to now, well done!",
      "You're doing really well at this point!",
      "Great job so far, keep going!",
      "You've been doing fantastic up to this moment.",
      "Impressive work up to now, continue like this!",
      "So far you've been doing incredibly well.",
      "You're definitely on the right path, keep it up!",
      "Up until now, you're doing wonderfully.",
      "You've made great progress so far, keep it up!",
      "Excellent performance up to this point!",
      "So far you've exceeded expectations, fantastic job!",
      "You're doing exceptionally well so far.",
      "Great work up to this moment, you're on the right track!",
      "So far your performance has been outstanding.",
      "You're doing brilliantly so far, keep going!",
      "Up to now, everything seems perfect, well done!",
      "So far you're nailing it, fantastic work!",
      "You've been on point up to now, excellent!",
      "Great execution so far, keep the momentum going!",
      "So far, your progress is impressive, keep it up!",
      "You're doing just fine up to this moment, continue like this!",
      "So far, your work is commendable, well done!",
      "You're acing it so far, fantastic!",
      "Up to now, you've been doing superbly well.",
      "Your work so far is remarkable, keep it up!",
      "So far, everything's going perfectly, great job!",
      "You've done really well up to this point.",
      "So far, so excellent, you're on the right track!",
      "You're handling everything well so far, keep going!",
      "Your performance has been stellar up to now.",
      "So far, you're doing everything right, well done!",
      "Great results so far, keep pushing forward!",
      "So far your efforts are paying off, great job!",
      "You're making great strides so far, keep at it!",
      "Up to this moment, you're doing really well.",
      "Your progress so far is impressive, keep going!",
      "So far, your results have been great, keep it up!",
      "You're doing quite well up to now, keep it going!",
      "So far, your work is on point, great job!",
      "You're on the right track so far.",
      "So far, so good with your progress.",
      "Up to this point, you've been doing great.",
      "Your performance has been impressive thus far.",
      "You've made some solid progress up to now.",
      "So far, your efforts are really paying off.",
      "You're doing a fantastic job up to this moment.",
      "Everything seems to be going well for you so far.",
      "You've been excelling at this up until now.",
      "Up to now, you've really shown great promise.",
      "Thus far, your work has been remarkable.",
      "So far, you're achieving wonderfully.",
      "Your journey's been quite successful up to here.",
      "You've managed things well up to this point.",
      "Your progress so far has been commendable.",
      "So far, your efforts have been spot on.",
      "You've really outdone yourself so far.",
      "Up to this stage, you're doing exceptionally well.",
      "Your achievements so far are noteworthy.",
      "So far, you've surpassed expectations.",
      "You're maintaining a good pace so far.",
      "Your progress is on the right path so far.",
      "Up to this point, your performance is stellar.",
      "You've kept up the good work so far.",
      "So far, you're showing a lot of promise.",
      "You've been on a roll up to now.",
      "So far, your approach has been effective.",
      "Your efforts up to now haven't gone unnoticed.",
      "Up to this moment, you've been doing excellently."
    ],
    "no, turn around":[
      "Actually, that's not the right way, you need to turn around.",
      "Oops, you're headed the wrong way, best to turn back.",
      "Looks like you're off track, time to reverse course.",
      "You seem to be going the wrong way, better turn around.",
      "That's not quite right, you should head back the other way.",
      "You're moving in the wrong direction, time to turn around.",
      "This isn't the way, let's make a U-turn.",
      "Wrong way, you need to go back the other way.",
      "You're not on the correct path, turn around please.",
      "Looks like a wrong turn, best to go back.",
      "You're heading the opposite way, better reverse.",
      "This direction isn't right, let's turn back.",
      "You're veering off course, time to head back.",
      "Not that way, you need to turn around.",
      "You're moving away from the target, let's turn around.",
      "That's the wrong direction, we need to go back.",
      "You've taken a wrong turn, let's reverse that.",
      "This isn't the correct route, turn around when you can.",
      "You're going astray, better to head back the other way.",
      "Not the right way, let's make a turnaround.",
      "You're off the path, let's go back the right way.",
      "This direction isn't leading us right, time to go back.",
      "You're not heading the right way, let's turn around.",
      "Looks like we need to backtrack, this isn't the right way.",
      "You've missed the mark, let's turn around.",
      "This route isn't correct, we need to head back.",
      "Wrong direction, it's time to turn around.",
      "You're not on the right track, let's reverse.",
      "This isn't the way to go, better turn back now.",
      "You're going the opposite direction, let's turn around.",
      "No, please go back the other way.",
      "No, head in the opposite direction.",
      "No, reverse your direction.",
      "No, spin around to face the other way.",
      "No, you need to do a 180.",
      "No, turn back around.",
      "No, pivot and face the other way.",
      "No, make a complete turnaround.",
      "No, go back the way you came.",
      "No, switch your direction.",
      "No, rotate yourself around.",
      "No, about-face, please.",
      "No, head back in the reverse direction.",
      "No, it's time to turn the other way.",
      "No, swivel around, please.",
      "No, let's go in the opposite direction.",
      "No, you're going to want to turn back.",
      "No, face the other direction.",
      "No, let's backtrack.",
      "No, veer around, please.",
      "No, do an about-turn.",
      "No, reverse your course.",
      "No, swing around to the other side.",
      "No, flip your direction.",
      "No, time to go the other way.",
      "No, make a U-turn.",
      "No, backtrack a bit.",
      "No, reverse your path.",
      "No, twist around.",
      "No, let's make a switch in direction.",
      "No, it's the opposite way.",
      "No, you've got to turn it around.",
      "No, rotate in the opposite direction.",
      "No, you're facing the wrong way.",
      "No, change your heading.",
      "No, take a spin the other way.",
      "No, let's reverse directions.",
      "No, you should head the other way.",
      "No, twist and go back.",
      "No, it's time to reverse your bearing."
    ],
    "Turn back.": [
      "Please rotate your body 180 degrees.",
      "Can you make a complete pivot now?",
      "It's time to spin yourself around.",
      "We need to reverse our direction immediately.",
      "Could you swivel to face the opposite way?",
      "Let's execute a U-turn right here.",
      "I think we should double back to our starting point.",
      "Turn over to see the other side.",
      "Flip around to the other direction.",
      "Make a 180-degree turn right now.",
      "Perform an about-face as soon as possible.",
      "Change your direction swiftly.",
      "Rearrange your position to the opposite.",
      "Recast your orientation towards the back.",
      "Remodel your stance to face backwards.",
      "Revolve your body to the other side.",
      "Swing around to the opposite view.",
      "Circle back to where we began.",
      "Retrace your steps immediately.",
      "Head back the way you came.",
      "Rotate on your heels right away.",
      "Let's make a complete reversal.",
      "Shift your focus behind you.",
      "It's time to swerve around.",
      "Execute a volte-face now.",
      "Redirect your path to the opposite.",
      "Loop back to the initial point.",
      "Perform a reverse maneuver.",
      "Spin on your axis to face the other way.",
      "Alter your course to return.",
      "Let's backtrack to our previous position.",
      "Reverse your orientation swiftly.",
      "Make a swift pivot to the rear.",
      "Wheel around in the opposite direction.",
      "Let's head in the reverse direction.",
      "Time to perform a flip to the back.",
      "Swivel 180 degrees to face backward.",
      "Turn your gaze in the opposite direction.",
      "Rotate your perspective completely.",
      "Swing back to where you started.",
      "Make a quick reversal of direction.",
      "Do a half turn to face the other way.",
      "Let's reroute towards the back.",
      "Turn over to face the other side.",
      "Let's make an immediate turnabout.",
      "Rotate to look behind you.",
      "Veer around to the opposite way.",
      "It's time to reverse our course.",
      "Spin back to the starting point.",
      "Make a detour back to the beginning.",
      "Reverse your steps right now.",
      "Let's turn tail and go back.",
      "Swivel to see what's behind you.",
      "Make a complete rotation to the rear.",
      "Let's revert to our original direction.",
      "Swing your focus to the opposite side.",
      "Turn over a new leaf in the opposite direction.",
      "It's time to backtrack our route.",
      "Rotate to the rear and proceed.",
      "Perform a 180-degree shift now.",
      "Swivel around to face the other way.",
      "Reverse your track immediately.",
      "Let's make a counter-turn now.",
      "Wheel back to the point of origin.",
      "Perform a turnabout to go back.",
      "Let's reverse our tracks right away.",
      "Swivel your position to face backward.",
      "It's time to circle back around.",
      "Make a quick about-turn.",
      "Rotate to face the opposite direction."
    ],
    "You have gone to the wrong direction.": [
      "You've taken an incorrect route.",
      "You are heading in the wrong way.",
      "Your direction is not correct.",
      "You have strayed from the right path.",
      "You're moving towards the wrong destination.",
      "Your course is incorrect.",
      "You have deviated from the correct direction.",
      "You're not going the right way.",
      "Your path is misguided.",
      "You seem to be on an erroneous route.",
      "You're not on the correct track.",
      "Your current direction is mistaken.",
      "You've chosen the wrong way to go.",
      "Your navigation has led you astray.",
      "You're not heading towards the intended direction.",
      "You've made a wrong turn somewhere.",
      "You're not following the right path.",
      "You have veered off the correct course.",
      "You're not going in the direction you should be.",
      "You're travelling the wrong way.",
      "You're on the wrong path.",
      "You have wandered off the correct path.",
      "You're moving in the opposite direction of where you need to be.",
      "You seem to have lost your way.",
      "You're not proceeding in the right direction.",
      "You're off the correct route.",
      "You're following an incorrect path.",
      "You've ended up on the wrong track.",
      "You're not navigating towards the right destination.",
      "You've incorrectly chosen this direction.",
      "You're not on the path you're supposed to be on.",
      "You've made a mistake in your direction.",
      "You're not heading the right way.",
      "You've strayed to the wrong direction.",
      "Your route is not the right one.",
      "You seem to have taken a wrong direction.",
      "Your way is not the right way.",
      "You're not traveling in the correct direction.",
      "You're going against the right direction.",
      "You've lost the correct path.",
      "Your direction is off course.",
      "You're not on the correct course.",
      "You've diverged from the right way.",
      "You are not following the correct way.",
      "You're moving away from the right direction.",
      "Your path does not lead to the right place.",
      "You've ended up going the wrong way.",
      "Your journey is in the wrong direction.",
      "You're not on the right track.",
      "You've deviated towards the wrong direction.",
      "You're not headed in the right direction.",
      "Your way is leading you astray.",
      "You're moving in the wrong direction.",
      "Your direction seems to be incorrect.",
      "You're not taking the correct path.",
      "You've gone off in the wrong direction.",
      "You're not going where you're supposed to.",
      "Your route choice is wrong.",
      "You've turned towards the wrong way.",
      "You're not moving towards the right place.",
      "You're heading in the opposite of the right direction.",
      "You seem to be veering off the right track.",
      "Your direction choice is mistaken.",
      "You're not walking on the right path.",
      "You have picked the wrong direction.",
      "You've misdirected yourself from the correct path.",
      "You seem to be heading away from the right route.",
      "Your trajectory is leading you in the wrong direction.",
      "You're not aligning with the proper direction.",
      "Your current route is not leading you correctly."
    ],
    "dynamic template": [
      "Make sure to {obj['action']} to open the {obj['name']}.",
      "To access the {obj['name']}, you'll need to {obj['action']}.",
      "Remember, {obj['action']} is how you open the {obj['name']}.",
      "The key to opening the {obj['name']} is to {obj['action']}.",
      "You should {obj['action']} if you want to open the {obj['name']}.",
      "To get the {obj['name']} open, just {obj['action']}.",
      "The way to open the {obj['name']} is by {obj['action']}.",
      "For opening the {obj['name']}, your best bet is to {obj['action']}.",
      "To unlock the {obj['name']}, be sure to {obj['action']}.",
      "The method to open the {obj['name']} involves {obj['action']}.",
      "Opening the {obj['name']}? Just {obj['action']}.",
      "To crack open the {obj['name']}, you'll need to {obj['action']}.",
      "Simply {obj['action']} to open up the {obj['name']}.",
      "Your action should be to {obj['action']} to open the {obj['name']}.",
      "The trick to opening the {obj['name']} is to {obj['action']}.",
      "For the {obj['name']}, you have to {obj['action']} to open it.",
      "Initiate {obj['action']} to unlock the {obj['name']}.",
      "To pry open the {obj['name']}, make sure to {obj['action']}.",
      "Your move should be to {obj['action']} to access the {obj['name']}.",
      "Got to {obj['action']} if opening the {obj['name']} is the goal.",
      "Ensure you {obj['action']} to swing open the {obj['name']}.",
      "Opening the {obj['name']} requires you to {obj['action']}.",
      "If you're looking to open the {obj['name']}, make sure to {obj['action']}.",
      "A must-do to open the {obj['name']} is to {obj['action']}.",
      "Want to unlock the {obj['name']}? Your move is to {obj['action']}.",
      "The secret to accessing the {obj['name']} is simply to {obj['action']}.",
      "{obj['action']} is the step to take to unveil the {obj['name']}.",
      "To fling open the {obj['name']}, it's essential to {obj['action']}.",
      "To make the {obj['name']} accessible, don't forget to {obj['action']}.",
      "Cracking the {obj['name']} open? That means you should {obj['action']}.",
      "To reveal the inside of the {obj['name']}, you'll want to {obj['action']}.",
      "For an open {obj['name']}, the action needed is to {obj['action']}.",
      "The pathway to opening the {obj['name']} is through {obj['action']}.",
      "Unlocking the {obj['name']} is as simple as deciding to {obj['action']}.",
      "The formula for opening the {obj['name']} involves a {obj['action']}.",
      "To disengage the {obj['name']}, a {obj['action']} is necessary.",
      "Dive into the {obj['name']} by making sure to {obj['action']}.",
      "The entrance to the {obj['name']} is unlocked by a {obj['action']}.",
      "To swing the {obj['name']} open, a {obj['action']} is required.",
      "The {obj['name']} will yield if you simply {obj['action']}.",
      "Deciding to {obj['action']} is how you'll explore the {obj['name']}.",
      "To venture into the {obj['name']}, start with a {obj['action']}.",
      "Peek inside the {obj['name']} by ensuring you {obj['action']}.",
      "The clue to the {obj['name']}? Just {obj['action']}.",
      "Unveiling the {obj['name']} begins with a decisive {obj['action']}.",
      "To spring open the {obj['name']}, your tactic should be to {obj['action']}.",
      "A {obj['action']} will grant you access to the {obj['name']}.",
      "To breach the {obj['name']}, a {obj['action']} is your key.",
      "Daring to {obj['action']} will unveil the {obj['name']}.",
      "The {obj['name']} awaits, just {obj['action']} to discover what's inside.",
      "To traverse into the {obj['name']}, the action is to {obj['action']}.",
      "Unlocking the secrets of the {obj['name']}? Begin with {obj['action']}.",
      "For entry into the {obj['name']}, ensure you {obj['action']}.",
      "To turn the {obj['name']} open, a simple {obj['action']} is required.",
      "To dismantle the barrier of the {obj['name']}, {obj['action']} is the method.",
      "The {obj['name']} will not stay closed if you {obj['action']}.",
      "Eager to explore the {obj['name']}? It starts with a {obj['action']}.",
      "A {obj['action']} is your passport to the inside of the {obj['name']}.",
      "To lay bare the {obj['name']}, one must {obj['action']}.",
      "The door to the {obj['name']} only opens with a {obj['action']}.",
      "To dismantle the lock on the {obj['name']}, proceed to {obj['action']}.",
      "For full access to the {obj['name']}, your strategy is to {obj['action']}.",
      "The {obj['name']} is yours to explore, simply {obj['action']}.",
      "To cross the threshold of the {obj['name']}, initiate a {obj['action']}.",
      "Navigating into the {obj['name']}? That'll require you to {obj['action']}.",
      "The {obj['name']} opens with a straightforward {obj['action']}.",
      "For the {obj['name']} to reveal its contents, you must {obj['action']}.",
      "To unfurl the {obj['name']}, a quick {obj['action']} is all it takes.",
      "Accessing the contents of the {obj['name']} means you need to {obj['action']}.",
      "Embark on opening the {obj['name']} by deciding to {obj['action']}."
    ],
    "future template": [
      "You'll find the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} is located in the {room2name[obj['room']]}.",
      "Look for the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} can be found in the {room2name[obj['room']]}.",
      "Check the {room2name[obj['room']]} for the {obj['name']}.",
      "The {obj['name']} is kept in the {room2name[obj['room']]}.",
      "You should find the {obj['name']} in the {room2name[obj['room']]}.",
      "The {room2name[obj['room']]} is where the {obj['name']} is.",
      "Go to the {room2name[obj['room']]} to find the {obj['name']}.",
      "The {obj['name']} is placed in the {room2name[obj['room']]}.",
      "You will locate the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} is stored in the {room2name[obj['room']]}.",
      "For the {obj['name']}, check the {room2name[obj['room']]}.",
      "The {room2name[obj['room']]} houses the {obj['name']}.",
      "You'll spot the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} resides in the {room2name[obj['room']]}.",
      "Expect to find the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} is situated in the {room2name[obj['room']]}.",
      "Head to the {room2name[obj['room']]} to locate the {obj['name']}.",
      "The {obj['name']} is in the {room2name[obj['room']]} area.",
      "Seek the {obj['name']} within the {room2name[obj['room']]} for discovery.",
      "In the {room2name[obj['room']]}, the {obj['name']} awaits your find.",
      "To uncover the {obj['name']}, venture into the {room2name[obj['room']]}.",
      "Your quest for the {obj['name']} ends in the {room2name[obj['room']]}.",
      "For locating the {obj['name']}, the {room2name[obj['room']]} is key.",
      "Discover the {obj['name']} nestled in the {room2name[obj['room']]}.",
      "The {room2name[obj['room']]} holds the secret of the {obj['name']}.",
      "Venture to the {room2name[obj['room']]} to uncover the {obj['name']}.",
      "The {obj['name']} makes its home in the {room2name[obj['room']]}.",
      "Find the {obj['name']} comfortably placed within the {room2name[obj['room']]}.",
      "A journey to the {room2name[obj['room']]} will reveal the {obj['name']}.",
      "In the heart of the {room2name[obj['room']]}, the {obj['name']} resides.",
      "Scour the {room2name[obj['room']]} to find the {obj['name']} nestled there.",
      "The {room2name[obj['room']]} is the designated spot for the {obj['name']}.",
      "Your search for the {obj['name']} should lead you to the {room2name[obj['room']]}.",
      "The {room2name[obj['room']]} is the assigned haven for the {obj['name']}.",
      "Dive into the {room2name[obj['room']]} to fetch the {obj['name']}.",
      "The {obj['name']} has made the {room2name[obj['room']]} its abode.",
      "In the domain of the {room2name[obj['room']]}, the {obj['name']} is found.",
      "The treasure of the {obj['name']} lies within the {room2name[obj['room']]} confines.",
      "Embark towards the {room2name[obj['room']]} to secure the {obj['name']}.",
      "The {room2name[obj['room']]} is the treasure trove for the {obj['name']}.",
      "Navigate to the {room2name[obj['room']]} where the {obj['name']} is stationed.",
      "Within the walls of the {room2name[obj['room']]}, the {obj['name']} can be discovered.",
      "The {obj['name']} has taken residence in the {room2name[obj['room']]} space.",
      "The {room2name[obj['room']]} serves as the sanctuary for the {obj['name']}.",
      "To grasp the {obj['name']}, step into the {room2name[obj['room']]}.",
      "The {room2name[obj['room']]} plays host to the elusive {obj['name']}.",
      "The {obj['name']} positions itself within the {room2name[obj['room']]} for you to find.",
      "A quest in the {room2name[obj['room']]} will lead you to the {obj['name']}.",
      "The {obj['name']} is enshrined in the {room2name[obj['room']]} awaiting discovery.",
      "A foray into the {room2name[obj['room']]} is necessary to lay hands on the {obj['name']}.",
      "Mark the {room2name[obj['room']]} as your destination to collect the {obj['name']}.",
      "The {room2name[obj['room']]} is your clue to finding the {obj['name']}.",
      "In pursuit of the {obj['name']}, the {room2name[obj['room']]} will be your guide.",
      "The {obj['name']} lies in wait within the comforting embrace of the {room2name[obj['room']]}.",
      "Target the {room2name[obj['room']]} to encounter the {obj['name']}.",
      "The {obj['name']} anchors itself in the {room2name[obj['room']]}, ready for discovery.",
      "Probe the {room2name[obj['room']]} to unveil the {obj['name']}.",
      "Search the {room2name[obj['room']]} to uncover the {obj['name']}.",
      "The {room2name[obj['room']]} is the spot to find the {obj['name']}.",
      "To get the {obj['name']}, go to the {room2name[obj['room']]}.",
      "You'll discover the {obj['name']} inside the {room2name[obj['room']]}.",
      "The {obj['name']} awaits in the {room2name[obj['room']]}.",
      "Find the {obj['name']} located within the {room2name[obj['room']]}.",
      "Hunt for the {obj['name']} in the {room2name[obj['room']]}.",
      "The {obj['name']} makes its home in the {room2name[obj['room']]}.",
      "Your search for the {obj['name']} should lead to the {room2name[obj['room']]}.",
      "In the {room2name[obj['room']]}, the {obj['name']} can be located.",
      "Seek out the {obj['name']} in the {room2name[obj['room']]}."
    ],
    "Drop the carried object.": [
      "Go ahead and set down what you're holding.",
      "You can put down the item you're carrying now.",
      "Feel free to drop what's in your hands.",
      "It's time to let go of the object you have.",
      "Please release the item you're currently holding.",
      "You can place the thing you're carrying on the ground.",
      "It's okay to let go of what you're holding now.",
      "Why not put down the thing in your hands?",
      "You should release the object you're carrying.",
      "Now's the time to set down what you have in your hands.",
      "Go ahead and drop the item in your grasp.",
      "It's time to unload what you've been carrying.",
      "Feel free to let go of the thing you're holding.",
      "You can release the object in your hands now.",
      "Let's put down the item you're currently holding.",
      "Please set down whatever you're carrying at the moment.",
      "You might want to drop that thing you're holding.",
      "It's a good time to release what's in your hands.",
      "You can let go of the object you've got now.",
      "Why don't you set down the item you're holding?",
      "Put down what you're holding.",
      "Release the object you've picked up.",
      "Let go of the item in your hands.",
      "Place the carried item back down.",
      "Unload the object you're carrying.",
      "Set down what you've been holding.",
      "Deposit the item you're carrying.",
      "Leave the object you've picked up.",
      "Discharge the carried object.",
      "Unload what's in your hands.",
      "Drop what you're currently holding.",
      "Put the item down gently.",
      "Release the grip on your object.",
      "Let the carried object go.",
      "Place down the object gently.",
      "Set the item you're holding free.",
      "Leave what you've carried behind.",
      "Cast down the carried item.",
      "Deposit what's in your grasp.",
      "Lay down the object with care.",
      "Unburden yourself of the object.",
      "Discard the item gently.",
      "Abandon the held object.",
      "Relinquish your hold on the object.",
      "Eject the item from your hold.",
      "Shed the object you've been carrying.",
      "Dispose of the carried object appropriately.",
      "Ditch the item you're holding.",
      "Expedite the object to the ground.",
      "Reposition the carried item to the floor.",
      "Detoxicate yourself of the object.",
      "Drop off the item you're holding.",
      "Let the object find its place on the ground.",
      "Uncarry the presently held item.",
      "Release your cargo gently.",
      "Allow the object to rest.",
      "Place the object in a resting position.",
      "Guide the object back to the ground.",
      "Transition the object from hand to land.",
      "Disengage from the carried object.",
      "Lower the object to the ground.",
      "Give the object a new resting spot.",
      "Unhand the item you've been carrying.",
      "Release the held object into its spot.",
      "Let gravity take the object.",
      "Ease the object out of your grasp.",
      "Offer the object to the ground.",
      "Gently relinquish the carried item.",
      "Permit the object to leave your hands.",
      "Guide the carried object to its place."
    ],
    "Go to the kitchen.": [
      "Why don't you head over to the kitchen?",
      "Could you make your way to the kitchen?",
      "It's time to move towards the kitchen.",
      "Please proceed to the kitchen.",
      "I suggest going to the kitchen now.",
      "It would be great if you could go to the kitchen.",
      "How about heading to the kitchen?",
      "Let's go to the kitchen.",
      "Can you walk into the kitchen?",
      "Make your way towards the kitchen, please.",
      "It's a good idea to head to the kitchen now.",
      "The kitchen is where you need to be.",
      "Would you mind going to the kitchen?",
      "Please find your way to the kitchen.",
      "The kitchen is your next stop.",
      "I think it's time to head to the kitchen.",
      "Could you move towards the kitchen?",
      "Please make a trip to the kitchen.",
      "Let's make our way to the kitchen.",
      "It's time to go into the kitchen.",
      "Head over to the kitchen.",
      "Make your way to the kitchen.",
      "Please proceed to the kitchen.",
      "Move towards the kitchen.",
      "Can you go into the kitchen?",
      "It's time to head to the kitchen.",
      "Walk into the kitchen, please.",
      "Let's go to the kitchen.",
      "Would you mind going to the kitchen?",
      "Navigate your way into the kitchen.",
      "Could you head towards the kitchen?",
      "Find your way to the kitchen.",
      "Step into the kitchen.",
      "Proceed into the kitchen area.",
      "Make a move towards the kitchen.",
      "Shift yourself to the kitchen.",
      "Transition to the kitchen.",
      "Advance to the kitchen.",
      "Relocate to the kitchen.",
      "Mosey on over to the kitchen.",
      "Journey to the kitchen.",
      "Travel to the kitchen.",
      "Move on over to the kitchen.",
      "Take a trip to the kitchen.",
      "Direct yourself to the kitchen.",
      "Saunter over to the kitchen.",
      "Venture into the kitchen.",
      "Wander into the kitchen.",
      "Stroll into the kitchen.",
      "Get yourself to the kitchen.",
      "March into the kitchen.",
      "Proceed directly to the kitchen.",
      "Aim for the kitchen.",
      "Beeline for the kitchen.",
      "Hustle over to the kitchen.",
      "Drift into the kitchen.",
      "Meander into the kitchen.",
      "Sashay into the kitchen.",
      "Amble into the kitchen.",
      "Pace towards the kitchen.",
      "Stride into the kitchen.",
      "Trek to the kitchen.",
      "Parade into the kitchen.",
      "Glide into the kitchen.",
      "Scoot over to the kitchen.",
      "Jog over to the kitchen.",
      "Dash into the kitchen.",
      "Bolt to the kitchen.",
      "Sprint into the kitchen.",
      "Gallop into the kitchen."
    ],
    "Go to the living room.": [
      "Why not make your way to the living room?",
      "Could you head over to the living room?",
      "Please make your way into the living room.",
      "I suggest going to the living room now.",
      "How about moving towards the living room?",
      "It's time to head into the living room.",
      "Would you mind going to the living room?",
      "Let's head to the living room.",
      "Can you walk into the living room?",
      "Please proceed towards the living room.",
      "The living room is where you need to go next.",
      "Feel free to go to the living room.",
      "It would be great if you could head to the living room.",
      "Let's make our way to the living room, shall we?",
      "The living room is your next destination.",
      "I think you should go to the living room now.",
      "Please find your way to the living room.",
      "Let's move to the living room.",
      "Could you move towards the living room, please?",
      "The living room is calling your name, head on over.",
      "Head over to the living room.",
      "Move towards the living room.",
      "Please proceed to the living room.",
      "Make your way into the living room.",
      "It's time to go into the living room.",
      "Could you enter the living room?",
      "Let's go into the living room.",
      "Shift to the living room, please.",
      "Step into the living room.",
      "Walk into the living room.",
      "Advance to the living room.",
      "Navigate your way to the living room.",
      "Transition into the living room.",
      "Proceed into the living room area.",
      "Move forward to the living room.",
      "Direct yourself to the living room.",
      "Relocate to the living room.",
      "Let's head to the living room.",
      "Time to shift to the living room.",
      "Please make a move to the living room.",
      "Journey into the living room.",
      "Migrate towards the living room.",
      "Venture into the living room.",
      "Wander into the living room.",
      "Stride into the living room.",
      "Saunter over to the living room.",
      "March into the living room.",
      "Trek to the living room.",
      "Proceed to the living area.",
      "Make a beeline for the living room.",
      "Hustle into the living room.",
      "Drift into the living room.",
      "Glide into the living room.",
      "Slide over to the living room.",
      "Scoot over to the living room.",
      "Float into the living room.",
      "Stroll into the living room.",
      "Ambulate into the living room.",
      "Traverse to the living room.",
      "Jog over to the living room.",
      "Sprint into the living room.",
      "Bolt to the living room.",
      "Dash into the living room.",
      "Race into the living room.",
      "Zoom into the living room.",
      "Speed into the living room.",
      "Hurry into the living room.",
      "Beat a path to the living room.",
      "Charge into the living room.",
      "Leap towards the living room."
    ],
    "Go to the dining room.": [
      "Please head over to the dining room.",
      "Could you make your way to the dining room?",
      "It's time to move to the dining room.",
      "Why not stroll into the dining room?",
      "Let's go to the dining room now.",
      "How about heading towards the dining room?",
      "I suggest going to the dining room.",
      "Can you proceed to the dining room?",
      "The dining room is your next stop.",
      "Would you mind heading into the dining room?",
      "Feel free to move to the dining room.",
      "Let's make a trip to the dining room.",
      "It would be great if you could go into the dining room.",
      "The dining room awaits, let's head there.",
      "Let's check out the dining room.",
      "Please find your way to the dining room.",
      "You should visit the dining room next.",
      "How about we move to the dining room?",
      "The dining room is just around the corner, let's go.",
      "Shall we head to the dining room?",
      "Head over to the dining room.",
      "Make your way to the dining room.",
      "Move towards the dining room.",
      "Proceed to the dining room.",
      "Walk into the dining room.",
      "Enter the dining room.",
      "Please go into the dining room.",
      "Step into the dining room.",
      "Navigate to the dining room.",
      "Shift to the dining room.",
      "Transition to the dining room.",
      "Relocate to the dining room.",
      "Advance to the dining room.",
      "Approach the dining room.",
      "Find your way to the dining room.",
      "Direct yourself to the dining room.",
      "Head straight to the dining room.",
      "Make a move towards the dining room.",
      "Proceed directly to the dining room.",
      "Take a walk to the dining room.",
      "Journey to the dining room.",
      "Set course for the dining room.",
      "Travel to the dining room.",
      "Wander into the dining room.",
      "Stroll into the dining room.",
      "Get yourself to the dining room.",
      "Move yourself to the dining room.",
      "Steer towards the dining room.",
      "Shift your location to the dining room.",
      "Change your position to the dining room.",
      "Guide yourself into the dining room.",
      "Saunter into the dining room.",
      "Meander to the dining room.",
      "Proceed in the direction of the dining room.",
      "Make your path to the dining room.",
      "Align your route to the dining room.",
      "Migrate to the dining room.",
      "Transition yourself to the dining room.",
      "Take steps towards the dining room.",
      "March into the dining room.",
      "Trek to the dining room.",
      "Jog over to the dining room.",
      "Hustle to the dining room.",
      "Sprint to the dining room.",
      "Dash to the dining room.",
      "Race to the dining room.",
      "Bolt to the dining room.",
      "Hurry into the dining room.",
      "Speed to the dining room.",
      "Zoom into the dining room."
    ],
    "Pick up the front object.": [
      "Could you grab the object in front of you?",
      "Please pick up the item right ahead.",
      "Why not take hold of the object that's right in front?",
      "The object up front needs picking up, can you do that?",
      "Feel free to grab what's directly in front of you.",
      "How about lifting the item that's right before you?",
      "You might want to pick up what's lying ahead.",
      "Let's see you grab that front object, please.",
      "Can you take the object located right in front?",
      "Please retrieve the item straight ahead of you.",
      "It's time to pick up the object that's in front.",
      "Why don't you lift the object that's right before you?",
      "The item in front is waiting for you to pick it up.",
      "Go ahead and take the object in your path.",
      "Can you handle the object just in front?",
      "Let's get that object picked up, the one right in front.",
      "Please take the front object into your hands.",
      "The front object there, could you pick it up?",
      "How about taking the object that's lying ahead?",
      "Would you mind picking up what's in front of you?",
      "Grab the object that's right in front of you.",
      "Take hold of the object lying ahead.",
      "Lift the item you see in front.",
      "Retrieve the object positioned directly ahead.",
      "Collect the item situated in front of you.",
      "Grasp the object located at the front.",
      "Seize the item that's right before you.",
      "Snatch up the object placed in front.",
      "Get the object that's in front of you.",
      "Secure the item positioned right ahead.",
      "Gather the object laying at the front.",
      "Scoop up the frontmost object.",
      "Clutch the item that's directly in front.",
      "Snag the object situated right ahead.",
      "Pick the object from the front.",
      "Hoist the item located in your path.",
      "Haul the object that's right in front.",
      "Fetch the item situated directly before you.",
      "Pluck the object from the front.",
      "Capture the item right ahead of you.",
      "Nab the object positioned at the front.",
      "Recover the item directly in front.",
      "Grapple the object in front of you.",
      "Ensnare the item that's lying ahead.",
      "Extract the object from the front.",
      "Embrace the item right in front.",
      "Commandeer the object positioned ahead.",
      "Apprehend the item situated in front.",
      "Annex the object that's directly ahead.",
      "Claim the item located in front.",
      "Corral the object right before you.",
      "Draw the item from the front towards you.",
      "Elevate the object in front.",
      "Liberate the item right ahead.",
      "Dislodge the object from the front.",
      "Detach the item in front.",
      "Wrest the object that's lying ahead.",
      "Pry the item from the front.",
      "Finesse the object directly in front.",
      "Engage the item right before you.",
      "Maneuver the object in front.",
      "Navigate towards and pick up the front object.",
      "Orchestrate the retrieval of the item in front.",
      "Procure the object situated right ahead.",
      "Rally to grasp the item in front.",
      "Summon the strength to lift the front object.",
      "Unearth the object from the front.",
      "Venture to pick up the item ahead.",
      "Wangle the object directly in front.",
      "Yield the item from the front to your grasp."
    ],
    "You complete the task.": [
      "You've successfully finished the task.",
      "You've accomplished the task.",
      "You've concluded the task.",
      "You've finalized the task.",
      "You've wrapped up the task.",
      "The task has been completed by you.",
      "You've managed to complete the task.",
      "You've effectively executed the task.",
      "You've fulfilled the requirements of the task.",
      "You've achieved completion of the task.",
      "The task has been fully completed by you.",
      "You've brought the task to a close.",
      "You've reached the end of the task.",
      "The task is now complete, thanks to you.",
      "You've carried out the task to completion.",
      "You've seen the task through to the end.",
      "You've successfully carried out the task.",
      "The task is finished, courtesy of your efforts.",
      "You've brought the task to completion.",
      "You've executed the task successfully.",
      "You've rounded off the task.",
      "The task has been concluded by you.",
      "You've nailed the task.",
      "You've hit the target with the task.",
      "You've completed the assignment.",
      "You've discharged your duty in completing the task.",
      "You've come through in completing the task.",
      "The task has met its completion by your hand.",
      "You've ticked off the task.",
      "You've checked off the task.",
      "You've squared away the task.",
      "You've polished off the task.",
      "The task has been taken care of by you.",
      "You've mastered the task.",
      "You've crossed the finish line with the task.",
      "You've put the final touches on the task.",
      "You've dotted the i's and crossed the t's on the task.",
      "You've put the task to bed.",
      "You've settled the task.",
      "You've buttoned up the task.",
      "The task is now under your belt.",
      "You've cleared the task.",
      "You've signed off on the task.",
      "You've capped off the task.",
      "You've drawn the task to a conclusion.",
      "You've wound up the task.",
      "You've terminated the task.",
      "You've put the lid on the task.",
      "You've laid the task to rest.",
      "You've put the task in the rearview mirror.",
      "You've sealed the deal on the task.",
      "You've stamped the task as complete.",
      "You've ushered the task to its end.",
      "You've clinched the task.",
      "You've put paid to the task.",
      "You've brought the curtain down on the task.",
      "The task has been executed to completion by you.",
      "You've put the finishing stroke on the task.",
      "You've brought the task to its culmination.",
      "You've put a period at the end of the task.",
      "You've put the capstone on the task.",
      "You've drawn a line under the task.",
      "You've closed the book on the task.",
      "You've put the final nail in the coffin of the task.",
      "You've wrapped the task up with a bow.",
      "You've hit the mark with the task.",
      "You've successfully ticked the task off your list.",
      "The task is now fully resolved, thanks to you.",
      "You've effectively brought the task to its end.",
      "The task is 100% done, all due to your efforts."
    ]
}